In [61]:
import pandas as pd

In [62]:
people = {
    'first': ['Jose Edmar','Lucas', 'Adeguimar'],
    'last': ['Siqueira', 'Siqueira', 'Lacerda'],
    'email': ['edmar.ade@gmail.com', 'lucas@hotmail.com','adeguimar@gmail.com']
}

In [63]:
df = pd.DataFrame(people)

In [64]:
df

        first      last                email
0  Jose Edmar  Siqueira  edmar.ade@gmail.com
1       Lucas  Siqueira    lucas@hotmail.com
2   Adeguimar   Lacerda  adeguimar@gmail.com

In [65]:
#Visualizar as Colunas
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [66]:
#renomear todas as colunas
df.columns = ['first_name', 'last_name', 'email']

In [67]:
#visualizar a mudança
df

   first_name last_name                email
0  Jose Edmar  Siqueira  edmar.ade@gmail.com
1       Lucas  Siqueira    lucas@hotmail.com
2   Adeguimar   Lacerda  adeguimar@gmail.com

In [68]:
#podemos mudar os os nomes das columnas por compreensão de lista
#neste exemplo vamos mudar tudo para maiusculo
df.columns = [x.upper() for x in df.columns]

In [69]:
df

   FIRST_NAME LAST_NAME                EMAIL
0  Jose Edmar  Siqueira  edmar.ade@gmail.com
1       Lucas  Siqueira    lucas@hotmail.com
2   Adeguimar   Lacerda  adeguimar@gmail.com

In [70]:
#mudar um caracter
df.columns = df.columns.str.replace('_', ' ')
df

   FIRST NAME LAST NAME                EMAIL
0  Jose Edmar  Siqueira  edmar.ade@gmail.com
1       Lucas  Siqueira    lucas@hotmail.com
2   Adeguimar   Lacerda  adeguimar@gmail.com

In [71]:
#mudar um caracter
df.columns = df.columns.str.replace(' ', '_')
df

   FIRST_NAME LAST_NAME                EMAIL
0  Jose Edmar  Siqueira  edmar.ade@gmail.com
1       Lucas  Siqueira    lucas@hotmail.com
2   Adeguimar   Lacerda  adeguimar@gmail.com

In [72]:
#podemos mudar os os nomes das columnas por compreensão de lista
#neste exemplo vamos mudar tudo para minusculo
df.columns = [x.lower() for x in df.columns]

In [73]:
df

   first_name last_name                email
0  Jose Edmar  Siqueira  edmar.ade@gmail.com
1       Lucas  Siqueira    lucas@hotmail.com
2   Adeguimar   Lacerda  adeguimar@gmail.com

In [74]:
#renomear a colunas especifica
df.rename(columns={'first_name' : 'first', 'last_name':'last'}, inplace=True)

In [75]:
df

        first      last                email
0  Jose Edmar  Siqueira  edmar.ade@gmail.com
1       Lucas  Siqueira    lucas@hotmail.com
2   Adeguimar   Lacerda  adeguimar@gmail.com

In [76]:
#renomear linhas
df.loc[1]

first                Lucas
last              Siqueira
email    lucas@hotmail.com
Name: 1, dtype: object

In [77]:
#primeira opção podemos passar todos os campo
df.loc[1] = ['Lucas Dias', 'Siqueirinha', 'lucas@gmail.com']
df

        first         last                email
0  Jose Edmar     Siqueira  edmar.ade@gmail.com
1  Lucas Dias  Siqueirinha      lucas@gmail.com
2   Adeguimar      Lacerda  adeguimar@gmail.com

In [78]:
# o metodos anterior funciona porém é trabalhoso mudar varias linhas, podemos usar loc e filtra a linha que queremos mudar
df.loc[1, ['last', 'email']] = ['Siqueira', 'lucasSiqueira@gmail.com']

In [79]:
df

        first      last                    email
0  Jose Edmar  Siqueira      edmar.ade@gmail.com
1  Lucas Dias  Siqueira  lucasSiqueira@gmail.com
2   Adeguimar   Lacerda      adeguimar@gmail.com

In [80]:
# mudar um unico valor
df.loc[1, 'last'] = 'Siqueira'

In [81]:
df

        first      last                    email
0  Jose Edmar  Siqueira      edmar.ade@gmail.com
1  Lucas Dias  Siqueira  lucasSiqueira@gmail.com
2   Adeguimar   Lacerda      adeguimar@gmail.com

In [82]:
# mudemos mudar um unico valor usando a funcao at conforme abaixo
df.at[1, 'last'] = 'Siqueirinha'

In [83]:
df

        first         last                    email
0  Jose Edmar     Siqueira      edmar.ade@gmail.com
1  Lucas Dias  Siqueirinha  lucasSiqueira@gmail.com
2   Adeguimar      Lacerda      adeguimar@gmail.com

In [84]:
# maneira errada de tentar altera o valor 
filt = (df['email'] == 'edmar.ade@gmail.com')
df[filt]['last'] = 'Siqueirao'

/tmp/ipykernel_6241/990408422.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Siqueirao'

In [85]:
# forma correta de altera o campo com realizando o filtro
filt = (df['email'] == 'edmar.ade@gmail.com')
df.loc[filt, 'last'] = 'Siqueirao'

In [86]:
df

        first         last                    email
0  Jose Edmar    Siqueirao      edmar.ade@gmail.com
1  Lucas Dias  Siqueirinha  lucasSiqueira@gmail.com
2   Adeguimar      Lacerda      adeguimar@gmail.com

In [87]:
# Modificar todas as colunas do Dataframe
df['email'] = df['email'].str.upper()

In [88]:
df

        first         last                    email
0  Jose Edmar    Siqueirao      EDMAR.ADE@GMAIL.COM
1  Lucas Dias  Siqueirinha  LUCASSIQUEIRA@GMAIL.COM
2   Adeguimar      Lacerda      ADEGUIMAR@GMAIL.COM

In [89]:
# Existe quatro metodo para atualziar os dados
#apply
#map
#applymap
#replace

In [90]:
#vamos ver a aply, usando em siries
#vamos contar os caracteres do e-mail
df['email'].apply(len)

0    19
1    23
2    19
Name: email, dtype: int64

In [91]:
def lower_email(email):
    return email.lower()

In [92]:
df['email'].apply(lower_email)

0        edmar.ade@gmail.com
1    lucassiqueira@gmail.com
2        adeguimar@gmail.com
Name: email, dtype: object

In [93]:
df

        first         last                    email
0  Jose Edmar    Siqueirao      EDMAR.ADE@GMAIL.COM
1  Lucas Dias  Siqueirinha  LUCASSIQUEIRA@GMAIL.COM
2   Adeguimar      Lacerda      ADEGUIMAR@GMAIL.COM

In [94]:
# mudando os valores
df['email'] = df['email'].apply(lower_email)

In [95]:
df

        first         last                    email
0  Jose Edmar    Siqueirao      edmar.ade@gmail.com
1  Lucas Dias  Siqueirinha  lucassiqueira@gmail.com
2   Adeguimar      Lacerda      adeguimar@gmail.com

In [96]:
# podemos ter o mesmo resultado usando uma funcaao lambida
#vamos deixar nosso e-mail tudo em maiusculo
df['email'] = df['email'].apply(lambda x: x.upper())

In [97]:
#visualizar
df

        first         last                    email
0  Jose Edmar    Siqueirao      EDMAR.ADE@GMAIL.COM
1  Lucas Dias  Siqueirinha  LUCASSIQUEIRA@GMAIL.COM
2   Adeguimar      Lacerda      ADEGUIMAR@GMAIL.COM

In [98]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [99]:
#visualizar menor valor, funciona melhor com dados númericos
df.apply(pd.Series.min)

first              Adeguimar
last                 Lacerda
email    ADEGUIMAR@GMAIL.COM
dtype: object

In [100]:
#mesma consulta com funcao lambda
df.apply(lambda x : x.min())

first              Adeguimar
last                 Lacerda
email    ADEGUIMAR@GMAIL.COM
dtype: object

In [101]:
#metodos para os dados da Tabela
df.applymap(len)

   first  last  email
0     10     9     19
1     10    11     23
2      9     7     19

In [102]:
#mudar todos os dados da tabelas
df.applymap(str.lower)

        first         last                    email
0  jose edmar    siqueirao      edmar.ade@gmail.com
1  lucas dias  siqueirinha  lucassiqueira@gmail.com
2   adeguimar      lacerda      adeguimar@gmail.com

In [103]:
#Usar map para mudar valor na Data Series, passamos os campos que queremos mudar em um dicionáio
#porém usando o map os valores que não mudarmos vai ficar no NaN
df['first'].map({'Lucas Dias' : 'Lucas', 'Adeguimar' : 'Adeguimar'})

0          NaN
1        Lucas
2    Adeguimar
Name: first, dtype: object

In [104]:
#Para náo ficar com NaN devemos usar o replace
df['first'].replace({'Lucas Dias': 'Lucas', 'Adeguimar' : 'Adeguimar'})

0    Jose Edmar
1         Lucas
2     Adeguimar
Name: first, dtype: object

In [105]:
df

        first         last                    email
0  Jose Edmar    Siqueirao      EDMAR.ADE@GMAIL.COM
1  Lucas Dias  Siqueirinha  LUCASSIQUEIRA@GMAIL.COM
2   Adeguimar      Lacerda      ADEGUIMAR@GMAIL.COM

In [106]:
#tudo que foi feito não foi modificado realmente  na tabela,
#para mudar realmente devemos usar conforme abaixo
df['first'] = df['first'].replace({'Lucas Dias': 'Lucas', 'Adeguimar' : 'Adeguimar'})

In [107]:
df

        first         last                    email
0  Jose Edmar    Siqueirao      EDMAR.ADE@GMAIL.COM
1       Lucas  Siqueirinha  LUCASSIQUEIRA@GMAIL.COM
2   Adeguimar      Lacerda      ADEGUIMAR@GMAIL.COM

In [108]:
#mudar somente o Ultimo nome do Lucas
df['last'] = df['last'].replace({'Siqueirinha': 'Siqueira'})

In [109]:
df

        first       last                    email
0  Jose Edmar  Siqueirao      EDMAR.ADE@GMAIL.COM
1       Lucas   Siqueira  LUCASSIQUEIRA@GMAIL.COM
2   Adeguimar    Lacerda      ADEGUIMAR@GMAIL.COM